app/controllers/issues_controller.rb

  def index
    @issues = Issue.paginate(:page => params[:page], :per_page => Issue::PER_PAGE)
    .as_json(:include => [:photos => {:methods => [:kinds], :except => [:image_content_type, :image_file_name, :image_file_size, :image_updated_at]}])
---
SELECT COUNT(*) FROM `issues`
SELECT `issues`.* FROM `issues` LIMIT 2 OFFSET 0
SELECT `photos`.* FROM `photos` WHERE `photos`.`issue_id` = 20

  def open
    Issue.user_id = Stock.user_id = @user_id
    @issues = Issue.open.paginate(:page => params[:page], :per_page => Issue::PER_PAGE)
      .as_json(:methods => [:is_joining, :user_money],
    :include => [{:stocks => {:include => {:photo => {:methods => [:kinds]}},
    :methods => [:user_stock_cnt, :this_week, :total, :buy_avg_money, :last_day_money]}},
    :photo => {:methods => [:kinds]}])
---
SELECT COUNT(*) FROM `issues` WHERE (end_date >= CURDATE())
SELECT `issues`.* FROM `issues` WHERE (end_date >= CUR_DATE()) LIMIT 10 OFFSET 10
SELECT `photos`.* FROM `photos` WHERE `photos`.`issue_id` = 20

  def closed
    Issue.user_id = @user_id
    @closed_issues = Issue.closed
    @issues = @closed_issues.paginate(:page => params[:page], :per_page => Issue::PER_PAGE)
      .as_json(:methods => [:is_joining, :is_settled],
    :include => [{:stocks => {:include => {:photo => {:methods => [:kinds]}},
    :methods => [:user_stock_cnt, :last_week, :this_week, :total]}},
    :photo => {:methods => [:kinds]}])
---
SELECT COUNT(*) FROM `issues` WHERE (end_date < CURDATE())
SELECT `issues`.* FROM `issues` WHERE (end_date < CURDATE()) LIMIT 10 OFFSET 0
SELECT `photos`.* FROM `photos` WHERE `photos`.`issue_id` = 22