app/controllers/sessions_controller.rb

  def create
    info = env['omniauth.auth']
    if !info.nil?
      case info[:provider]
      when 'twitter'
        if !user_exist?
          gon.user = User.create_with(:name => info[:info][:name], :image => info[:info][:image], :sns_id => info[:uid],
                           :email => "#{info[:info][:name]}@twitter.com", :mem_type => TWITTER,
                           :money => APP_CONFIG['seed_money'], :nickname => info[:info][:nickname])
                  .find_or_create_by(:email => "#{info[:info][:name]}@twitter.com")
        else
          gon.user = User.update(@userId,:acc_token => User.new.gen_token, :expires => User.new.gen_expires)
---
INSERT INTO `users` (`acc_token`, `email`, `expires`, `image`, `mem_type`, `money`, `name`, `sns_id`) VALUES ('iJZ3viX4i7RlKcQEket8gg', 'belhyun@twitter.com', '2014-07-04 15:25:20', 'http://pbs.twimg.com/profile_images/1219763963/myProfileImage_normal.jpg', 'T', 1000, 'belhyun', '177910822')
SELECT `users`.* FROM `users` WHERE (sns_id = '690605770995668' AND expires >= '2014-05-09 09:52:44') ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `acc_token` = 'HCEb9C1tf7OEQpUHWku9lg', `expires` = '2014-07-08 09:52:44' WHERE `users`.`id` = 55

  def guest
    if !user_exist?
      gon.user = User.create(:mem_type => GUEST, :money => APP_CONFIG['seed_money'],:nickname => params.permit(:nick)[:nick])
---
INSERT INTO `users` (`acc_token`, `email`, `expires`, `mem_type`, `money`, `name`, `nickname`) VALUES ('G9lLaiFOnLHWMW-uUGFVUg', 'GUEST_49@versus.com', '2014-07-04 15:01:22', 'G', 1000, 'GUEST_49', 'GUEST_49')