app/controllers/stocks_controller.rb

SELECT `user_stocks`.* FROM `user_stocks` ORDER BY `user_stocks`.`id` ASC LIMIT 1
SELECT `stocks`.* FROM `stocks` WHERE `stocks`.`id` = 2 ORDER BY `stocks`.`id` ASC LIMIT 1
UPDATE `stocks` SET `money` = 33, `updated_at` = '2014-05-15 11:03:50' WHERE `stocks`.`id` = 2
INSERT INTO `user_stocks` (`created_at`, `issue_id`, `stock_id`, `updated_at`, `user_id`) VALUES ('2014-05-15 11:09:57', 34, 2, '2014-05-15 11:09:57', 17)
SELECT COUNT(*) FROM `user_stocks` WHERE (stock_id = '2')
SELECT `users`.* FROM `users` WHERE (acc_token = 'LjRyPMku2AWrjn5DaQwgDA' AND expires >= '2014-05-15 06:13:57') ORDER BY `users`.`id` ASC LIMIT 1
SELECT `issues`.* FROM `issues` WHERE `issues`.`id` = 34 ORDER BY `issues`.`id` ASC LIMIT 1
---
  def buy
    stock_id = buy_params[:id]
    issue_id = @stock.issue.id
    stock_amounts = buy_params[:stock_amounts].to_i
    Stock.user_id = @user_id
    case User.buy_status(@user_id, stock_id, stock_amounts)
    when Code::MSG[:not_enough_money]
      render :json => fail(Code::MSG[:not_enough_money]) and return
    when Code::MSG[:success]
      unless UserStock.get(@user_id, stock_id, issue_id).blank?
        user_stock = UserStock.find(:first, :conditions => ["user_id = ? and stock_id = ? and issue_id = ?",@user_id, stock_id, issue_id])
        if !UserStock.find_by_id(user_stock.id).increment!(:stock_amounts, stock_amounts)
          render :json => fail(Code::MSG[:buy_transaction_fail]) and return
        end
      else
        user_stock = UserStock.create(:user_id => @user_id, :stock_id => stock_id, :issue_id => issue_id, :stock_amounts=> stock_amounts)
      end
      if User.buy_stocks(@user_id, @stock.money, stock_amounts) && stock_money = Stock.update_money(stock_id)
        insert_log(
          Code::BUY,
          stock_amounts,
          stock_id,
          issue_id,
          User.user_money(@user_id),
          @stock.money,
        )
        result = success(UserStock.find_by_id(user_stock.id).as_json(:include => [:user, {:stock => {:methods =>
                                                                     [:user_stock_cnt, :this_week, :buy_avg_money, :total]}}]))
        result[:body][:buy_stock_amounts] = stock_amounts
        result[:body][:stock_money] = stock_money
        result[:body][:issue] = Issue.open.find_by_id(issue_id).as_json(:methods => [:is_joining, :user_money],
          :include => [{:stocks => {:include => {:photo => {:methods => [:kinds]}},
          :methods => [:user_stock_cnt, :this_week, :total, :buy_avg_money]}},
          :photo => {:methods => [:kinds]}])