app/controllers/users_controller.rb

  def set_user
    @user = User.find_by_id(@user_id)
---
SELECT `users`.* FROM `users` WHERE (acc_token = 'FrkMSNnb-b9NyAIhNP7U6g' AND expires >= '2014-05-09 10:04:37') ORDER BY `users`.`id` ASC LIMIT 1